//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef _MOD_MIXWATERCONTROL_H
#define _MOD_MIXWATERCONTROL_H

#include <stdint.h>
#include <stdbool.h>
//------------------------------E N D-------------------------------------------
typedef enum
{
    MODE_AUTO  = (uint8_t)0,    /*自动模式*/
    MODE_MAN,                   /*人工模式*/
}mixWater_mode_t;

typedef enum
{  
    SET_COLD = ((uint8_t)0x00), 
    SET_WARM,
}mixWater_set_mode_t;

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//------------------------------E N D-------------------------------------------
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 混水开度计算
//功能: 
//入口: _in_mixMeasureTemp       混水测量温度  <<-------------------------传入
//入口: _in_backWaterMeasureTemp  回水测量温度  <<-------------------------传入
//入口: _in_mixSetTemp            混水设定温度      <<-------------------------传入
//出口: 无
void mod_mixWater_adjust(mixWater_set_mode_t mode,int16_t _in_mixMeasureTemp,int16_t _in_backWaterMeasureTemp,uint16_t _in_mixSetTemp);
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 设定混水开度
//功能: 
//入口: _in_puty  百分比 0-100 <<-------------------------传入
//出口: 无
void  mod_mixWater_set_puty(uint8_t _in_puty);
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//------------------------------E N D-------------------------------------------
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 当前阀门开度
//功能:  
//入口: 无
//出口: 阀门开度百分比 0-100
 uint8_t mod_mixWater_current_puty(void);
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
 
//------------------------------E N D-------------------------------------------
 
#endif
//-----------------------Mod_MixWaterControl.h--END-----------------------------------

