//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//AIO5功能层次图
//date：2020.10.27
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
输配中心
       |
       |--温度测量
	   |         |--一次侧进水温度
       |         |--一次侧回水温度
       |         |--二次侧回水温度
       |         `--二次侧混水温度
       |
       |--故障保护
       |         |--混水传感器故障
       |         |               |
       |         |               |--故障指示
       |         |               `--三通阀关闭
       |         |--二次侧回水传感器故障
       |         |              |
       |         |              `--故障指示
       |         |
       |         |--一次侧进水传感器故障
       |         |              |
       |         |              `--故障指示
	   |         |--一次侧回水传感器故障
       |         |              |
       |         |              `--故障指示
       |         |
       |         `--末端(房间温控器或者风盘控制器)离线
       |                   |
       |                   |--故障指示
       |                   `--执行器关闭
       |-- 混水温度计算
       |          |
       |          |--制冷状态
       |          |         |
       |          |         |--收集开机有辐射需求的末端
       |          |         |--比较末端露点温度获取最大露点温度
       |          |         `--将混水温度设置为该最大露点温度
       |          |
       |          `--制热状态
       |                    |--周期30分钟
       |                    `--根据末端的设定、测量温差值、末端的升温系数，计算供水温度，达到合理的热负荷匹配。
       |--运行逻辑
       |         |
       |         |--关机
       |         |     |
       |         |     |--防冻保护
       |         |     |         |
       |         |     |         |--回水温度 < 5 度
       |         |     |         |                |--防冻请求
       |         |     |         |                |--水泵运转
       |         |     |         |                |--三通阀开启，调整混水温度到制热的'设定温度'
       |         |     |         |                `--打开全部执行器
       |         |     |         `--回水温度 > 10 度
       |         |     |                          |--解除防冻需求
       |         |     |                          `--水泵、阀门、执行器重新处于待机状态
       |         |     |
       |         |     |--水泵停止运转
       |         |     |--三通阀关闭
       |         |     `--执行器关闭
       |         |     
       |         |
       |         `--开机
       |               |
       |               |--新风
       |               |     |--防冻保护
       |               |     |         |
       |               |     |         |--回水温度 < 5 度
       |               |     |         |                |--防冻请求
       |               |     |         |                |--水泵运转
       |               |     |         |                |--三通阀开启，调整混水温度到制热的'设定温度'
       |               |     |         |                `--打开全部执行器
       |               |     |         `--回水温度 > 10 度
       |               |     |                          |--解除防冻需求
       |               |     |                          `--水泵、阀门、执行器重新处于待机状态
       |               |     |
       |               |     |--水泵停止运转
       |               |     |--三通阀关闭
       |               |     `--执行器关闭
       |               |
       |               `--制冷、制热、除湿
       |                                 |
       |                                 |--初始能量需求
       |                                 |            |--对应的执行开启
       |                                 |            `--120s 后转入[重复能量需求]
       |                                 |--重复能量需求
       |                                 |            |
       |                                 |            |--水泵运转
       |                                 |            |--对应的执行开启
       |                                 |            |--混水温度调整到'计算温度'，规则见混水温度计算。
       |                                 |            `--末端能量需求全部解除，转入[无能量需求]
       |                                 `--无能量需求  
       |                                             |
       |                                             |--执行器关闭
       |                                             |--三通阀关闭
       |                                             |--水泵停止运转
       |                                             `--末端有能量需求，转入[初始能量需求]
       |                                   
       |                
       |-- 数据同步
       |          |
       |          |
       |          |
       |          |--房间温控器
       |          |           |--设定信息
       |          |           |         |
       |          |           |         |--阀门绑定列表
       |          |           |         |--开关机
       |          |           |         |--制冷模式设定温度
       |          |           |         |--制热模式设定温度
       |          |           |         |--防冻保护
       |          |           |         |--防冻温度
       |          |           |         |--露点保护温度
       |          |           |         `--周编程数据
       |          |           |         
       |          |           |--运行信息(状态、测量)
       |          |           |         |
       |          |           |         |--露点保护状态
       |          |           |         |--阀门输出
       |          |           |         |--房间温度
       |          |           |         `--房间湿度
       |          |           |
       |          |           `--故障信息
       |          |                     |--阀门绑定故障
       |          |                     `--传感器故障
       |          `--风盘控制器
       |                      |--群组信息
       |                      |         |
       |                      |         `--群组表
       |                      |--设定信息
       |                      |         |--阀门绑定列表(风盘)
       |                      |         |--阀门绑定列表(辐射)
       |                      |         |--开关机
       |                      |         |--风机档位(高、中、低、自动)
       |                      |         |--风盘、辐射协同设定
       |                      |         |--制冷模式设定温度
       |                      |         |--制热模式设定温度
       |                      |         |--防冻保护
       |                      |         |--防冻温度
       |                      |         |--露点保护温度
       |                      |         `--周编程数据
       |                      |
       |                      |--运行信息
       |                      |         |
       |                      |         |--风机状态(高、中、低)
       |                      |         |--露点保护状态
       |                      |         |--阀门输出
       |                      |         |--房间温度
       |                      |         `--房间湿度
       |                      |
       |                      `--故障信息
       |                                |--阀门绑定故障
       |                                `--传感器故障
       |
       `-- 通讯接口
                  |
                  |--末端控制器(风盘、辐射、除湿模块)
                  |             |
                  |             |--最大末端数 16 个
                  |             |--波特率9600(1S8N1)
                  |             `--数据同步
                  |
                  `--mibee智能
                          |
                          |--modbus slave
                          |             |--地址:01
                          |             |--波特率:9600
                          |             `--1S8N1
                          |
                          |--固件更新
                          |         |--本级更新(输配中心)
                          |         |
                          |         `--下级更新(除湿模块、风盘、辐射)
                          |
                          `--远程控制
                                    |--主机集成(环控、输配)
                                    |         |
                                    |         |--开关机
                                    |         |--运行设定
                                    |         |         |--模式选择
                                    |         |         |         |-- 新风
                                    |         |         |         |      |
                                    |         |         |         |      `--新风风速设定
                                    |         |         |         |-- 制冷
                                    |         |         |         |      |-- 制冷设定水温
                                    |         |         |         |      |-- 新风设定温度
                                    |         |         |         |      |-- 新风风速设定
                                    |         |         |         |      |-- 混水温度设定
                                    |         |         |         |      `-- 设定温度(风)
                                    |         |         |         |--强冷
                                    |         |         |         |      |
                                    |         |         |         |      |-- 制冷设定水温
                                    |         |         |         |      |-- 新风设定温度
                                    |         |         |         |      |-- 新风风速设定
                                    |         |         |         |      |-- 混水温度设定
                                    |         |         |         |      `-- 设定温度(风)
                                    |         |         |         |
                                    |         |         |         |-- 制热
                                    |         |         |         |      |-- 制热设定水温
                                    |         |         |         |      |-- 新风设定温度
                                    |         |         |         |      |-- 新风风速设定
                                    |         |         |         |      |-- 混水温度设定
                                    |         |         |         |      `-- 设定温度(风)
                                    |         |         |         `-- 除湿
                                    |         |         |                |-- 设定湿度
                                    |         |         |                `-- 新风风速设定
                                    |         |         |--混水温度
                                    |         |         |--混水AI使能
                                    |         |         `--生活热水
                                    |         |--运行状态
                                    |         |        |--
                                    |         |        `--
                                    |         |--参数设定
                                    |         |--测量数据
                                    |         `--
                                    |
                                    `--末端设备
                                    
				  
				  
         






//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++end++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++



