//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//环控机硬件规划
//date：2021.06.09
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//控制点,按控制对象统计
1、直流变频泵                 1个   继电器HF46F-G输出电源220V  PWM控制带转速反馈 
2、0-10V 三通比例调节阀       1个   0-10输入、带反馈、24V供电电压 
3、电热执行器输出            12个   可控硅输出  MOC3043
4、无源联动输出               2个   2路继电器输出
5、显示屏                     1个   3线制电平通讯(或RS485)
6、风盘/温控面板              1个   RS485接口，12V供电
7、环控中心控制               1个   RS485接口
8、MIBEE/远程控制             1个   TTL/对外RS485接口
9、预留远程控制               1个   RS485接口
10、预留外挂EEPROM            1个   SPI 接口
11、NTC传感器                 4个   ADC接口
12、预留数字量                2个   数字量输入


//MIBEE接口
1、网口                       1个   连接网络  
2、SD卡                       1个   程序烧录
3、预留远程控制               1个   RS485接口
4、预留易能森模块             1个   TTL电平接口

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
主控芯片：GD32F407VET6
主频：168MHz ROM 512KB  RAM 192KB





//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++end++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++



